---
kind: method
id: M:Autodesk.Revit.DB.FaceNode.GetFace
source: html/1ba08864-2a4b-a26d-6157-792e77a291c9.htm
---
# Autodesk.Revit.DB.FaceNode.GetFace Method

Returns the Face object corresponding to the node.

## Syntax (C#)
```csharp
public Face GetFace()
```

## Returns
The face.